In [21]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.arange(16).reshape(4,4),
             index=['台北','台中','台南', '高雄'],
             columns=['one', 'two', 'three', 'four'])
display(df)

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [22]:
#使用subscript[]選取欄
print(type(df['two']))
df['two']
int(df['two']['台中'])

<class 'pandas.core.series.Series'>

5

In [23]:
int(df.loc['台北']['two'])

1

In [24]:
#使用subscript[[]]
df[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [25]:
#使用loc[[]]
df.loc[['台北','台中']]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [26]:
df.loc[['台北','台中'],['one','two','three']]

    one  two  three
台北    0    1      2
台中    4    5      6

In [27]:
df.iloc[0:2,0:3]

    one  two  three
台北    0    1      2
台中    4    5      6

In [30]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.arange(9).reshape(3,3),
             index=['a','c','d'],
             columns=['台北','台中', '高雄'])
df

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [29]:
display(df.reindex(labels = ['a','c'],axis=0))
df.reindex(labels = ['台北','台中'],axis=1)

   台北  台中  高雄
a   0   1   2
c   3   4   5

   台北  台中
a   0   1
c   3   4
d   6   7

In [31]:
#使用DataFrame.reindex()
display(df.reindex(labels=['a','c'],axis=0))
display(df.reindex(labels=['台北','高雄'],axis=1))

   台北  台中  高雄
a   0   1   2
c   3   4   5

   台北  高雄
a   0   2
c   3   5
d   6   8

In [32]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4),
             index=['台北','台中','台南', '高雄'],
             columns=['one', 'two', 'three', 'four'])

df1

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [34]:
df1.drop(labels=['台北'],axis=0)

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [35]:
df1.drop(labels=['two','four'],axis=1)

    one  three
台北    0      2
台中    4      6
台南    8     10
高雄   12     14

In [36]:
import pandas as pd
df = pd.read_csv('各鄉鎮市區人口密度.csv')
df

,statistic_yyy,site_id,people_total,area,population_density
0,統計年,區域別,年底人口數,土地面積,人口密度
1,106,新北市板橋區,551480,23.1373,23835
2,106,新北市三重區,387484,16.317,23747
3,106,新北市中和區,413590,20.144,20532
4,106,新北市永和區,222585,5.7138,38956
...,...,...,...,...,...
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [37]:
df.head(n=10)

  statistic_yyy site_id people_total      area population_density
0           統計年     區域別        年底人口數      土地面積               人口密度
1           106  新北市板橋區       551480   23.1373              23835
2           106  新北市三重區       387484    16.317              23747
3           106  新北市中和區       413590    20.144              20532
4           106  新北市永和區       222585    5.7138              38956
5           106  新北市新莊區       416524   19.7383              21102
6           106  新北市新店區       302089  120.2255               2513
7           106  新北市樹林區       184149   33.1288               5559
8           106  新北市鶯歌區        86593   21.1248               4099
9           106  新北市三峽區       114926  191.4508                600

In [38]:
display(df.head(n=10))
display(df.tail(n=5))

  statistic_yyy site_id people_total      area population_density
0           統計年     區域別        年底人口數      土地面積               人口密度
1           106  新北市板橋區       551480   23.1373              23835
2           106  新北市三重區       387484    16.317              23747
3           106  新北市中和區       413590    20.144              20532
4           106  新北市永和區       222585    5.7138              38956
5           106  新北市新莊區       416524   19.7383              21102
6           106  新北市新店區       302089  120.2255               2513
7           106  新北市樹林區       184149   33.1288               5559
8           106  新北市鶯歌區        86593   21.1248               4099
9           106  新北市三峽區       114926  191.4508                600

,statistic_yyy,site_id,people_total,area,population_density
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN

In [39]:
df1 = df.drop(labels=[0],axis=0)
df1

,statistic_yyy,site_id,people_total,area,population_density
1,106,新北市板橋區,551480,23.1373,23835
2,106,新北市三重區,387484,16.317,23747
3,106,新北市中和區,413590,20.144,20532
4,106,新北市永和區,222585,5.7138,38956
5,106,新北市新莊區,416524,19.7383,21102
...,...,...,...,...,...
371,NaN,NaN,NaN,NaN,NaN
372,NaN,說明：1.人口密度係指每單位土地面積內之人口數。,NaN,NaN,NaN
373,NaN,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),NaN,NaN,NaN
374,NaN,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,NaN,NaN,NaN
375,NaN,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,NaN,NaN,NaN